Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes
The ReinforcementSetGroupAttributes class is the base attributes class for
ReinforcementSetGroup.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes class.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes class that loads the specified attributes.
AttributeFile:
The AttributeFile string.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.#ctor(System.Boolean)
Initializes a new instance of the Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes class, with SkipLoadingAttributes flag.
SkipLoadingAttributes:
The skip loading attributes.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.ReinforcementVisibility
Gets or sets which bars in the group appear in drawings.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.StraightEndSymbolType
Gets or sets how the straight ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.HookedEndSymbolType
Gets or sets how the hooked ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.